no_contact_or_file= 'Телефонная книга пуста или не открыта'

load_succeSSful='Телефонная книга успешно загружена'
new_contact_successful='Контакт успешно создан'

new_name='Введите имя и фимилию контакта: '
new_phone='Введите телефон контакта: '
new_comment='Введите комментарий к контакту: '

save_successful= 'Телефонная книга успешно сохранена'

is_changed='Были внесены изменения. Сохранить?'
bye_bye='До свидания! Всего хорошего!'

find_info='Введите данные для поиска: '
not_coincidence = 'Совпадений не найдено'
find_change_contact= 'Какой контакт изменить?'
change_menu='Что изменить?','1.Фио', '2.Телефон', '3.Комментарий'
change_menu_choice='Введите соответствующую цифру: '


new_change_name='Имя контакта изменено'
new_change_tel='Телефон контакта изменен'
new_change_com='Комментарий контакта изменен'

start_delete_contact='Какой контакт удалить?'
confirm_delete_contact='Вы уверены, что хотите удалить контакт?'
result_delete_contact='Контакт удален'


